app/Controllers/Auth/LoginController.php

SELECT *
FROM `users`
WHERE `email` = 'pradipmungasee2@gmail.com'
AND `deleted_at` IS NULL
SELECT `users`.`user_id`, `users`.`first_name`, `users`.`last_name`, `users`.`profile_pic`, `permissions`.`permission_name`
FROM `users`
JOIN `user_roles` ON `user_roles`.`user_id` = `users`.`user_id`
JOIN `role_permissions` ON `role_permissions`.`role_id` = `user_roles`.`role_id`
JOIN `permissions` ON `permissions`.`permission_id` = `role_permissions`.`permission_id`
WHERE `users`.`user_id` = '1'
---
    public function checkLogin(){
        $email = $this->request->getPost('email');
        $password = $this->request->getPost('password');

        $db = \Config\Database::connect();
        $user = $db->table('users')->where('email', $email)->get()->getRowArray();
        if ($user) {
            if (password_verify($password, $user['password'])) {
                // get all user and permissions data and format and then store into session
                $userData = $db->table('users')
                ->select('users.user_id, users.first_name, users.last_name, users.profile_pic, permissions.permission_name')
                ->join('user_roles', 'user_roles.user_id = users.user_id')
                ->join('role_permissions', 'role_permissions.role_id = user_roles.role_id')
                ->join('permissions', 'permissions.permission_id = role_permissions.permission_id')
                ->where('users.user_id', $user['user_id'])
                ->get()
                ->getResultArray();