app/Controllers/User/UserController.php

    public function index(){
        $db = \Config\Database::connect();
        $data['users'] = $db->table('users')
        ->where('deleted_at', null)
        ->get()
        ->getResultArray();
---
SELECT *
FROM `users`
WHERE `deleted_at` IS NULL