app/Controllers/User/UserController.php

SELECT *
FROM `users`
WHERE `deleted_at` IS NULL
AND `user_id` != '1'
---
    public function index(){
        $db = \Config\Database::connect();
        $data['users'] = $db->table('users')
        ->where('deleted_at', null)
        ->where('user_id !=', session()->get('user_data')['user_info']['user_id'])
        ->get()
        ->getResultArray();

SELECT *
FROM `roles`
---
    public function createUser(): string{
        $db = \Config\Database::connect();
        $data['roles']  = $db->table('roles')->get()->getResultArray();

INSERT INTO `users` (`first_name`, `last_name`, `email`, `password`, `dob`, `gender`, `profile_pic`, `address`) VALUES ('Pradip', 'Mungase', 'fintenttech@gmail.com', '$2y$10$1J5o6Xh6/jlEGzb8PuuIruaEjDpOdZ/NUv1hKTQPJBkmNHtuEqXKi', '2024-01-17', 'Male', '1705473917_0e6675a3477350cfea6b.jpg', 'Dedgaon')
---
        ];

        $db = \Config\Database::connect();
        $db->table('users')->insert($userData);

INSERT INTO `user_roles` (`user_id`, `role_id`) VALUES (3, '1')
---
            'user_id' => $user_id,
            'role_id' => $this->request->getPost('role'),
        ];
        $db->table('user_roles')->insert($roleData);

SELECT *
FROM `users`
WHERE `email` = 'fintenttech@gmail.com'
---
    private function isEmailUnique($email){
        $db = \Config\Database::connect();
        $result = $db->table('users')->getWhere(['email' => $email])->getRow();

SELECT `users`.*, `permissions`.`permission_name`
FROM `users`
JOIN `user_roles` ON `user_roles`.`user_id` = `users`.`user_id`
JOIN `role_permissions` ON `role_permissions`.`role_id` = `user_roles`.`role_id`
JOIN `permissions` ON `permissions`.`permission_id` = `role_permissions`.`permission_id`
WHERE `users`.`user_id` = '1'
---
    public function viewUser($user_id){
        $db = \Config\Database::connect();
        // get all user data with all permissions and roles
        $userData = $db->table('users')
        ->select('users.*, permissions.permission_name')
        ->join('user_roles', 'user_roles.user_id = users.user_id')
        ->join('role_permissions', 'role_permissions.role_id = user_roles.role_id')
        ->join('permissions', 'permissions.permission_id = role_permissions.permission_id')
        ->where('users.user_id', $user_id)
        ->get()
        ->getResultArray();

UPDATE `users` SET `deleted_at` = '2024-01-16 21:27:59'
WHERE `user_id` = '2'
---
    public function deleteUser($user_id){
       $db = \Config\Database::connect();
       // just update deleted at colume
       $result = $db->table('users')->where('user_id', $user_id)->update(['deleted_at' => date('Y-m-d H:i:s')]);

SELECT *
FROM `roles`
---
    public function register(){
        $db = \Config\Database::connect();
        $data['roles']  = $db->table('roles')->get()->getResultArray();